Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
   ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.lambda-qcNotes.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-qcNotes"
        name                  = "pgxflow-backend-qcNotes"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-qcNotes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/08a6929033a5987147a7aee340bdc7699abc32ab75fd7d69c0a054920a2e8023.zip" -> "builds/5fcae5daff2ded5d6ba61b1a0dc3b0d861470d10c1d6f29710fd8a344e6ba81c.zip"
        id                             = "pgxflow-backend-qcNotes"
      ~ last_modified                  = "2025-07-15T02:15:11.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:pgxflow_backend_python_modules_layer:12",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-qcNotes.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/lambda/qcNotes",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/5fcae5daff2ded5d6ba61b1a0dc3b0d861470d10c1d6f29710fd8a344e6ba81c.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/5fcae5daff2ded5d6ba61b1a0dc3b0d861470d10c1d6f29710fd8a344e6ba81c.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6153672621434572256" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/08a6929033a5987147a7aee340bdc7699abc32ab75fd7d69c0a054920a2e8023.zip" -> "builds/5fcae5daff2ded5d6ba61b1a0dc3b0d861470d10c1d6f29710fd8a344e6ba81c.zip"
          ~ "timestamp" = "1751333903592026000" -> "1754391445287608000"
        }
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/pgxflow-backend-sendJobEmail"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-sendJobEmail"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-sendJobEmail-0"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "lambda:InvokeFunction"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:lambda:ap-southeast-3:727260606489:function:cognito-sendClinicJobEmail"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs"
                    },
                  + {
                      + Action   = "cognito-idp:ListUsers"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:cognito-idp:ap-southeast-3:727260606489:userpool/ap-southeast-3_sNjfbidkU"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "pgxflow-backend-sendJobEmail"
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-sendJobEmail-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-sendJobEmail"
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Invokes sendJobEmail to send email to user"
      + filename                       = "builds/dbe5a7fe1c70271457859c78a97d99f5fb3bb59ac1969fde460690ec91500c2a.zip"
      + function_name                  = "pgxflow-backend-sendJobEmail"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "COGNITO_CLINIC_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:727260606489:function:cognito-sendClinicJobEmail"
              + "DYNAMO_CLINIC_JOBS_TABLE"        = "sbeacon-dataportal-clinic-jobs"
              + "USER_POOL_ID"                    = "ap-southeast-3_sNjfbidkU"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/lambda/sendJobEmail",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/dbe5a7fe1c70271457859c78a97d99f5fb3bb59ac1969fde460690ec91500c2a.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/dbe5a7fe1c70271457859c78a97d99f5fb3bb59ac1969fde460690ec91500c2a.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/dbe5a7fe1c70271457859c78a97d99f5fb3bb59ac1969fde460690ec91500c2a.zip"
          + "timestamp" = "1754391445616576000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-dbsnp will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-dbsnp" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250521064203402700000004",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-references-20250521064131152100000001",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250521064203402700000004/projects/*/project-files/*",
              + "arn:aws:s3:::pgxflow-backend-references-20250521064131152100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250521064132931100000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:727260606489:function:pgxflow-backend-lookup",
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-gnomad will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-gnomad" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250521064132931100000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250521064203402700000004/projects/*/clinical-workflows/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250521064132931100000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-lookup will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-lookup" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250521064132931100000003",
              + "arn:aws:s3:::pgxflow-backend-references-20250521064131152100000001",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250521064132931100000003/*",
              + "arn:aws:s3:::pgxflow-backend-references-20250521064131152100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250521064132931100000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:727260606489:function:pgxflow-backend-gnomad",
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.results-get will be destroyed
  # (because aws_api_gateway_integration.results-get is not in configuration)
  - resource "aws_api_gateway_integration" "results-get" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "f5jf7e" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-xka9g7txth-f5jf7e-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "f5jf7e" -> null
      - rest_api_id             = "xka9g7txth" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:727260606489:function:pgxflow-backend-lookup-getResultsURL/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.results-options will be destroyed
  # (because aws_api_gateway_integration.results-options is not in configuration)
  - resource "aws_api_gateway_integration" "results-options" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "f5jf7e" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "OPTIONS" -> null
      - id                      = "agi-xka9g7txth-f5jf7e-OPTIONS" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {
          - "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        } -> null
      - resource_id             = "f5jf7e" -> null
      - rest_api_id             = "xka9g7txth" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "MOCK" -> null
        # (5 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.submit-options will be destroyed
  # (because aws_api_gateway_integration.submit-options is not in configuration)
  - resource "aws_api_gateway_integration" "submit-options" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "49zcan" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "OPTIONS" -> null
      - id                      = "agi-xka9g7txth-49zcan-OPTIONS" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {
          - "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        } -> null
      - resource_id             = "49zcan" -> null
      - rest_api_id             = "xka9g7txth" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "MOCK" -> null
        # (5 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.submit-patch will be destroyed
  # (because aws_api_gateway_integration.submit-patch is not in configuration)
  - resource "aws_api_gateway_integration" "submit-patch" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "49zcan" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "PATCH" -> null
      - id                      = "agi-xka9g7txth-49zcan-PATCH" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "49zcan" -> null
      - rest_api_id             = "xka9g7txth" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:727260606489:function:pgxflow-backend-initLookup/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration.submit-post will be destroyed
  # (because aws_api_gateway_integration.submit-post is not in configuration)
  - resource "aws_api_gateway_integration" "submit-post" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "49zcan" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "POST" -> null
      - id                      = "agi-xka9g7txth-49zcan-POST" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "49zcan" -> null
      - rest_api_id             = "xka9g7txth" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:727260606489:function:pgxflow-backend-initLookup/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.results-get will be destroyed
  # (because aws_api_gateway_integration_response.results-get is not in configuration)
  - resource "aws_api_gateway_integration_response" "results-get" {
      - http_method         = "GET" -> null
      - id                  = "agir-xka9g7txth-f5jf7e-GET-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "f5jf7e" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "xka9g7txth" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.results-options will be destroyed
  # (because aws_api_gateway_integration_response.results-options is not in configuration)
  - resource "aws_api_gateway_integration_response" "results-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agir-xka9g7txth-f5jf7e-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "f5jf7e" -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          - "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,GET'"
          - "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        } -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "xka9g7txth" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.submit-options will be destroyed
  # (because aws_api_gateway_integration_response.submit-options is not in configuration)
  - resource "aws_api_gateway_integration_response" "submit-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agir-xka9g7txth-49zcan-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "49zcan" -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          - "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,PATCH,POST'"
          - "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        } -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "xka9g7txth" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.submit-patch will be destroyed
  # (because aws_api_gateway_integration_response.submit-patch is not in configuration)
  - resource "aws_api_gateway_integration_response" "submit-patch" {
      - http_method         = "PATCH" -> null
      - id                  = "agir-xka9g7txth-49zcan-PATCH-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "49zcan" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "xka9g7txth" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_integration_response.submit-post will be destroyed
  # (because aws_api_gateway_integration_response.submit-post is not in configuration)
  - resource "aws_api_gateway_integration_response" "submit-post" {
      - http_method         = "POST" -> null
      - id                  = "agir-xka9g7txth-49zcan-POST-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "49zcan" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "xka9g7txth" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.results-get will be destroyed
  # (because aws_api_gateway_method.results-get is not in configuration)
  - resource "aws_api_gateway_method" "results-get" {
      - api_key_required     = false -> null
      - authorization        = "COGNITO_USER_POOLS" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "nk0u8b" -> null
      - http_method          = "GET" -> null
      - id                   = "agm-xka9g7txth-f5jf7e-GET" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "f5jf7e" -> null
      - rest_api_id          = "xka9g7txth" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.results-options will be destroyed
  # (because aws_api_gateway_method.results-options is not in configuration)
  - resource "aws_api_gateway_method" "results-options" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "OPTIONS" -> null
      - id                   = "agm-xka9g7txth-f5jf7e-OPTIONS" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "f5jf7e" -> null
      - rest_api_id          = "xka9g7txth" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.submit-options will be destroyed
  # (because aws_api_gateway_method.submit-options is not in configuration)
  - resource "aws_api_gateway_method" "submit-options" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "OPTIONS" -> null
      - id                   = "agm-xka9g7txth-49zcan-OPTIONS" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "49zcan" -> null
      - rest_api_id          = "xka9g7txth" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.submit-patch will be destroyed
  # (because aws_api_gateway_method.submit-patch is not in configuration)
  - resource "aws_api_gateway_method" "submit-patch" {
      - api_key_required     = false -> null
      - authorization        = "COGNITO_USER_POOLS" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "nk0u8b" -> null
      - http_method          = "PATCH" -> null
      - id                   = "agm-xka9g7txth-49zcan-PATCH" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "49zcan" -> null
      - rest_api_id          = "xka9g7txth" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method.submit-post will be destroyed
  # (because aws_api_gateway_method.submit-post is not in configuration)
  - resource "aws_api_gateway_method" "submit-post" {
      - api_key_required     = false -> null
      - authorization        = "COGNITO_USER_POOLS" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "nk0u8b" -> null
      - http_method          = "POST" -> null
      - id                   = "agm-xka9g7txth-49zcan-POST" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "49zcan" -> null
      - rest_api_id          = "xka9g7txth" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method_response.results-get will be destroyed
  # (because aws_api_gateway_method_response.results-get is not in configuration)
  - resource "aws_api_gateway_method_response" "results-get" {
      - http_method         = "GET" -> null
      - id                  = "agmr-xka9g7txth-f5jf7e-GET-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "f5jf7e" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Origin" = true
        } -> null
      - rest_api_id         = "xka9g7txth" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method_response.results-options will be destroyed
  # (because aws_api_gateway_method_response.results-options is not in configuration)
  - resource "aws_api_gateway_method_response" "results-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agmr-xka9g7txth-f5jf7e-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "f5jf7e" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = true
          - "method.response.header.Access-Control-Allow-Methods" = true
          - "method.response.header.Access-Control-Allow-Origin"  = true
        } -> null
      - rest_api_id         = "xka9g7txth" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method_response.submit-options will be destroyed
  # (because aws_api_gateway_method_response.submit-options is not in configuration)
  - resource "aws_api_gateway_method_response" "submit-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agmr-xka9g7txth-49zcan-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "49zcan" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = true
          - "method.response.header.Access-Control-Allow-Methods" = true
          - "method.response.header.Access-Control-Allow-Origin"  = true
        } -> null
      - rest_api_id         = "xka9g7txth" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method_response.submit-patch will be destroyed
  # (because aws_api_gateway_method_response.submit-patch is not in configuration)
  - resource "aws_api_gateway_method_response" "submit-patch" {
      - http_method         = "PATCH" -> null
      - id                  = "agmr-xka9g7txth-49zcan-PATCH-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "49zcan" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Origin" = true
        } -> null
      - rest_api_id         = "xka9g7txth" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_method_response.submit-post will be destroyed
  # (because aws_api_gateway_method_response.submit-post is not in configuration)
  - resource "aws_api_gateway_method_response" "submit-post" {
      - http_method         = "POST" -> null
      - id                  = "agmr-xka9g7txth-49zcan-POST-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "49zcan" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Origin" = true
        } -> null
      - rest_api_id         = "xka9g7txth" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_resource.pipeline_lookup will be destroyed
  # (because aws_api_gateway_resource.pipeline_lookup is not in configuration)
  - resource "aws_api_gateway_resource" "pipeline_lookup" {
      - id          = "6vic5w" -> null
      - parent_id   = "p55u3edw3f" -> null
      - path        = "/pipeline_lookup" -> null
      - path_part   = "pipeline_lookup" -> null
      - region      = "ap-southeast-3" -> null
      - rest_api_id = "xka9g7txth" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_resource.results will be destroyed
  # (because aws_api_gateway_resource.results is not in configuration)
  - resource "aws_api_gateway_resource" "results" {
      - id          = "f5jf7e" -> null
      - parent_id   = "6vic5w" -> null
      - path        = "/pipeline_lookup/results" -> null
      - path_part   = "results" -> null
      - region      = "ap-southeast-3" -> null
      - rest_api_id = "xka9g7txth" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_api_gateway_resource.submit will be destroyed
  # (because aws_api_gateway_resource.submit is not in configuration)
  - resource "aws_api_gateway_resource" "submit" {
      - id          = "49zcan" -> null
      - parent_id   = "6vic5w" -> null
      - path        = "/pipeline_lookup/submit" -> null
      - path_part   = "submit" -> null
      - region      = "ap-southeast-3" -> null
      - rest_api_id = "xka9g7txth" -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.APIGetResultsURL will be destroyed
  # (because aws_lambda_permission.APIGetResultsURL is not in configuration)
  - resource "aws_lambda_permission" "APIGetResultsURL" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "pgxflow-backend-lookup-getResultsURL" -> null
      - id                  = "AllowAPIGetResultsURLInvoke" -> null
      - principal           = "apigateway.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:execute-api:ap-southeast-3:727260606489:xka9g7txth/*/*/results" -> null
      - statement_id        = "AllowAPIGetResultsURLInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.APIInitLookup will be destroyed
  # (because aws_lambda_permission.APIInitLookup is not in configuration)
  - resource "aws_lambda_permission" "APIInitLookup" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "pgxflow-backend-initLookup" -> null
      - id                  = "AllowAPIInitLookupInvoke" -> null
      - principal           = "apigateway.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:execute-api:ap-southeast-3:727260606489:xka9g7txth/*/*/submit" -> null
      - statement_id        = "AllowAPIInitLookupInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.LambdaDbsnp will be destroyed
  # (because aws_lambda_permission.LambdaDbsnp is not in configuration)
  - resource "aws_lambda_permission" "LambdaDbsnp" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "arn:aws:lambda:ap-southeast-3:727260606489:function:pgxflow-backend-dbsnp" -> null
      - id                  = "PGxFlowBackendAllowDbsnpInvoke" -> null
      - principal           = "lambda.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:lambda:ap-southeast-3:727260606489:function:pgxflow-backend-initLookup" -> null
      - statement_id        = "PGxFlowBackendAllowDbsnpInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.cloudwatch_lookup_reference_update_permission will be created
  + resource "aws_lambda_permission" "cloudwatch_lookup_reference_update_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-lookup-updateReferenceFiles"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = "arn:aws:events:ap-southeast-3:727260606489:rule/lookup_update_references_trigger"
      + statement_id        = "CloudwatchLookupReferenceUpdateAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.dbsnp_invoke_permission will be created
  + resource "aws_lambda_permission" "dbsnp_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-dbsnp"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSDbsnpAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_sns_topic.dbsnp will be created
  + resource "aws_sns_topic" "dbsnp" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "pgxflow-backend-dbsnp"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.aws_sns_topic_subscription.dbsnp will be created
  + resource "aws_sns_topic_subscription" "dbsnp" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:ap-southeast-3:727260606489:function:pgxflow-backend-dbsnp"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-gnomad will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-gnomad" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250521064132931100000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250521064203402700000004/projects/*/clinical-workflows/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-pharmcat will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-pharmcat" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250521064132931100000003",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250521064132931100000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:727260606489:function:pgxflow-backend-postprocessor",
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-postprocessor will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-postprocessor" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250521064203402700000004",
              + "arn:aws:s3:::pgxflow-backend-20250521064132931100000003",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250521064132931100000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250521064203402700000004/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:727260606489:function:pgxflow-backend-pharmcat-gnomad",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-preprocessor will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-preprocessor" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250521064203402700000004",
              + "arn:aws:s3:::pgxflow-backend-references-20250521064131152100000001",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250521064203402700000004/projects/*/project-files/*",
              + "arn:aws:s3:::pgxflow-backend-references-20250521064131152100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250521064132931100000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:727260606489:function:pgxflow-backend-pharmcat",
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.results-get will be destroyed
  # (because aws_api_gateway_integration.results-get is not in configuration)
  - resource "aws_api_gateway_integration" "results-get" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "7xouh8" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-xka9g7txth-7xouh8-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "7xouh8" -> null
      - rest_api_id             = "xka9g7txth" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:727260606489:function:pgxflow-backend-pharmcat-getResultsURL/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.results-options will be destroyed
  # (because aws_api_gateway_integration.results-options is not in configuration)
  - resource "aws_api_gateway_integration" "results-options" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "7xouh8" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "OPTIONS" -> null
      - id                      = "agi-xka9g7txth-7xouh8-OPTIONS" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {
          - "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        } -> null
      - resource_id             = "7xouh8" -> null
      - rest_api_id             = "xka9g7txth" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "MOCK" -> null
        # (5 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.submit-options will be destroyed
  # (because aws_api_gateway_integration.submit-options is not in configuration)
  - resource "aws_api_gateway_integration" "submit-options" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "rtq0da" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "OPTIONS" -> null
      - id                      = "agi-xka9g7txth-rtq0da-OPTIONS" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {
          - "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        } -> null
      - resource_id             = "rtq0da" -> null
      - rest_api_id             = "xka9g7txth" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "MOCK" -> null
        # (5 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.submit-patch will be destroyed
  # (because aws_api_gateway_integration.submit-patch is not in configuration)
  - resource "aws_api_gateway_integration" "submit-patch" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "rtq0da" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "PATCH" -> null
      - id                      = "agi-xka9g7txth-rtq0da-PATCH" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "rtq0da" -> null
      - rest_api_id             = "xka9g7txth" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:727260606489:function:pgxflow-backend-initPharmcat/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration.submit-post will be destroyed
  # (because aws_api_gateway_integration.submit-post is not in configuration)
  - resource "aws_api_gateway_integration" "submit-post" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "rtq0da" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "POST" -> null
      - id                      = "agi-xka9g7txth-rtq0da-POST" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "ap-southeast-3" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "rtq0da" -> null
      - rest_api_id             = "xka9g7txth" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:727260606489:function:pgxflow-backend-initPharmcat/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.results-get will be destroyed
  # (because aws_api_gateway_integration_response.results-get is not in configuration)
  - resource "aws_api_gateway_integration_response" "results-get" {
      - http_method         = "GET" -> null
      - id                  = "agir-xka9g7txth-7xouh8-GET-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "7xouh8" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "xka9g7txth" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.results-options will be destroyed
  # (because aws_api_gateway_integration_response.results-options is not in configuration)
  - resource "aws_api_gateway_integration_response" "results-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agir-xka9g7txth-7xouh8-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "7xouh8" -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          - "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,GET'"
          - "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        } -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "xka9g7txth" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.submit-options will be destroyed
  # (because aws_api_gateway_integration_response.submit-options is not in configuration)
  - resource "aws_api_gateway_integration_response" "submit-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agir-xka9g7txth-rtq0da-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "rtq0da" -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          - "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,PATCH,POST'"
          - "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        } -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "xka9g7txth" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.submit-patch will be destroyed
  # (because aws_api_gateway_integration_response.submit-patch is not in configuration)
  - resource "aws_api_gateway_integration_response" "submit-patch" {
      - http_method         = "PATCH" -> null
      - id                  = "agir-xka9g7txth-rtq0da-PATCH-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "rtq0da" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "xka9g7txth" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_integration_response.submit-post will be destroyed
  # (because aws_api_gateway_integration_response.submit-post is not in configuration)
  - resource "aws_api_gateway_integration_response" "submit-post" {
      - http_method         = "POST" -> null
      - id                  = "agir-xka9g7txth-rtq0da-POST-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "rtq0da" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = null
        } -> null
      - rest_api_id         = "xka9g7txth" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.results-get will be destroyed
  # (because aws_api_gateway_method.results-get is not in configuration)
  - resource "aws_api_gateway_method" "results-get" {
      - api_key_required     = false -> null
      - authorization        = "COGNITO_USER_POOLS" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "nk0u8b" -> null
      - http_method          = "GET" -> null
      - id                   = "agm-xka9g7txth-7xouh8-GET" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "7xouh8" -> null
      - rest_api_id          = "xka9g7txth" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.results-options will be destroyed
  # (because aws_api_gateway_method.results-options is not in configuration)
  - resource "aws_api_gateway_method" "results-options" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "OPTIONS" -> null
      - id                   = "agm-xka9g7txth-7xouh8-OPTIONS" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "7xouh8" -> null
      - rest_api_id          = "xka9g7txth" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.submit-options will be destroyed
  # (because aws_api_gateway_method.submit-options is not in configuration)
  - resource "aws_api_gateway_method" "submit-options" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "OPTIONS" -> null
      - id                   = "agm-xka9g7txth-rtq0da-OPTIONS" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "rtq0da" -> null
      - rest_api_id          = "xka9g7txth" -> null
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.submit-patch will be destroyed
  # (because aws_api_gateway_method.submit-patch is not in configuration)
  - resource "aws_api_gateway_method" "submit-patch" {
      - api_key_required     = false -> null
      - authorization        = "COGNITO_USER_POOLS" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "nk0u8b" -> null
      - http_method          = "PATCH" -> null
      - id                   = "agm-xka9g7txth-rtq0da-PATCH" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "rtq0da" -> null
      - rest_api_id          = "xka9g7txth" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method.submit-post will be destroyed
  # (because aws_api_gateway_method.submit-post is not in configuration)
  - resource "aws_api_gateway_method" "submit-post" {
      - api_key_required     = false -> null
      - authorization        = "COGNITO_USER_POOLS" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "nk0u8b" -> null
      - http_method          = "POST" -> null
      - id                   = "agm-xka9g7txth-rtq0da-POST" -> null
      - region               = "ap-southeast-3" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "rtq0da" -> null
      - rest_api_id          = "xka9g7txth" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method_response.results-get will be destroyed
  # (because aws_api_gateway_method_response.results-get is not in configuration)
  - resource "aws_api_gat
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.